903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/uart.c
#define __uart_get_dma_stream(uartx)	(	uartx == USART1 ? DMA2_Stream5 : \
											uartx == USART2 ? DMA1_Stream5 : \
											uartx == USART3 ? DMA1_Stream1 : \
											uartx == UART4 ? DMA1_Stream2 : \
											uartx == UART5 ? DMA1_Stream0 : \
											uartx == USART6 ? DMA2_Stream1 : \
											(int)0)

#define	__uart_get_dma_channel(uartx)		(	uartx == USART1 ? DMA_Channel_4 : \
												uartx == USART2 ? DMA_Channel_4 : \
												uartx == USART3 ? DMA_Channel_4 : \
												uartx == UART4 ? DMA_Channel_4 : \
												uartx == UART5 ? DMA_Channel_4 : \
												uartx == USART6 ? DMA_Channel_5 : \
												(int)0)
												
#define	__uart_get_dma_flag(uartx)		(	uartx == USART1 ? DMA_FLAG_TCIF5 : \
											uartx == USART2 ? DMA_FLAG_TCIF5 : \
											uartx == USART3 ? DMA_FLAG_TCIF1 : \
											uartx == UART4 ? DMA_FLAG_TCIF2 : \
											uartx == UART5 ? DMA_FLAG_TCIF0 : \
											uartx == USART6 ? DMA_FLAG_TCIF1 : \
											(int)0)

#elif defined(STM32F411xE)
											
#define __uart_get_irqn(uartx)	(	uartx == USART1 ? USART1_IRQn : \
									uartx == USART2 ? USART2_IRQn : \
                                    uartx == USART6 ? USART6_IRQn : \
									(int)0	)
											
#define __uart_get_index(uartx)	(	uartx == USART1 ? 0 : \
									uartx == USART2 ? 1 : \
                                    uartx == USART6 ? 5 : \
									(int)-1	)
										
#define	__uart_config_clock_enable(uartx)	{	if (uartx == USART1)		{RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);} \
												else if (uartx == USART2)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);} \
                                                else if (uartx == USART6)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);} \
											}

#define	__uart_config_gpio_clock_enable(port)	{	if (port == GPIOA)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);} \
													else if (port == GPIOB)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);} \
													else if (port == GPIOC)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);} \
													else if (port == GPIOD)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);} \
													else if (port == GPIOE)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);} \
													else if (port == GPIOF)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);} \
													else if (port == GPIOG)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);} \
												}

#define	__uart_config_dma_clock_enable(uartx)	{	if (uartx == USART1)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);} \
													else if (uartx == USART2)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
                                                    else if (uartx == USART6)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);} \
												}

#define	__uart_config_io_af_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF; \
												GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; \
												GPIO_InitStructure.GPIO_Pin = pin; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define	__uart_config_io_in_pu(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN; \
												GPIO_InitStructure.GPIO_Pin = pin; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define __uart_get_dma_stream(uartx)	(	uartx == USART1 ? DMA2_Stream5 : \
											uartx == USART2 ? DMA1_Stream5 : \
                                            uartx == USART6 ? DMA2_Stream1 : \
											(int)0)

#define	__uart_get_dma_channel(uartx)		(	uartx == USART1 ? DMA_Channel_4 : \
												uartx == USART2 ? DMA_Channel_4 : \
                                                uartx == USART6 ? DMA_Channel_5 : \
												(int)0)
												
#define	__uart_get_dma_flag(uartx)		(	uartx == USART1 ? DMA_FLAG_TCIF5 : \
											uartx == USART2 ? DMA_FLAG_TCIF5 : \
                                            uartx == USART6 ? DMA_FLAG_TCIF1 : \
											(int)0)

#endif

#define MAX_USART_NUM			6									// 串口外设最大数量
#define MAX_RX_STRING_LENGTH	1024								// 接收文本数据包最大长度

static char g_rx_str[MAX_USART_NUM][MAX_RX_STRING_LENGTH];			// 接收文本数据包
static uint8_t g_rx_str_flag[MAX_USART_NUM];						// 接收文本数据包标志位

/* UART私有数据结构体 */
typedef struct {
	uint8_t index;	// 索引
}UARTPrivData_t;

/* 函数声明 */
static int __uart_dma_recv_enable(UARTDev_t *dev);
static int __uart_send_byte(UARTDev_t *dev, uint8_t byte);
static int __uart_send_array(UARTDev_t *dev, uint8_t *array, uint16_t length);
static int __uart_send_string(UARTDev_t *dev, char *str);
static int __uart_send_number(UARTDev_t *dev, uint32_t num, uint8_t length);
static int __uart_send_hex_packet(UARTDev_t *dev, uint8_t *packet, uint8_t length, uint8_t head, uint8_t end);
static int __uart_printf(UARTDev_t *dev, char *format, ...);
static char *__uart_recv_string(UARTDev_t *dev);
static uint8_t __uart_recv_string_flag(UARTDev_t *dev);
static int __uart_deinit(UARTDev_t *dev);

/******************************************************************************
 * @brief	初始化UART
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/											
int uart_init(UARTDev_t *dev)
{
	if (!dev)
		return -1;
	
	/* 保存私有数据 */
	dev->priv_data = (UARTPrivData_t *)malloc(sizeof(UARTPrivData_t));
	if (!dev->priv_data)
		return -1;
	
	UARTPrivData_t *priv_data = (UARTPrivData_t *)dev->priv_data;

	priv_data->index = __uart_get_index(dev->config.uartx);

	/* 配置时钟与GPIO */
	__uart_config_clock_enable(dev->config.uartx);
	__uart_config_gpio_clock_enable(dev->config.tx_port);
	__uart_config_gpio_clock_enable(dev->config.rx_port);
	__uart_config_io_af_pp(dev->config.tx_port, dev->config.tx_pin);
	__uart_config_io_af_pp(dev->config.rx_port, dev->config.rx_pin);
	
	#if defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
	if (dev->config.uartx == USART1)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
	}
	else if (dev->config.uartx == USART2)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
	}
	else if (dev->config.uartx == USART2)
	{
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_USART3);
	}
	else if (dev->config.uartx == UART4)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);
	}
	else if (dev->config.uartx == UART5)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_UART5);
		GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_UART5);
	}
	else if (dev->config.uartx == USART6)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);
	}
	#endif
	
	/* 配置USART */
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = dev->config.baud;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(dev->config.uartx, &USART_InitStructure);
	
	/* 配置中断 */
	USART_ITConfig(dev->config.uartx, USART_IT_RXNE, ENABLE);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = __uart_get_irqn(dev->config.uartx);
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	/* 开启USART */
	USART_Cmd(dev->config.uartx, ENABLE);
	
	/* 函数指针赋值 */
	dev->send_byte = __uart_send_byte;
	dev->send_array = __uart_send_array;
	dev->send_string = __uart_send_string;
	dev->send_number = __uart_send_number;
	dev->send_hex_packet = __uart_send_hex_packet;
	dev->printf = __uart_printf;
	dev->recv_string = __uart_recv_string;
	dev->recv_string_flag = __uart_recv_string_flag;
	dev->deinit = __uart_deinit;
	
	dev->dma_Flag = false;
	dev->init_flag = true;
	return 0;
}

