903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/uart.c
/******************************************************************************
 * @brief	初始化UART并配置为DMA接收数据
 * @param	dev	:  UARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/											
int uart_dma_init(UARTDev_t *dev)
{
	/* UART初始化 */
	uart_init(dev);
	
	/* 保存私有数据 */
	UARTPrivData_t *priv_data = (UARTPrivData_t *)dev->priv_data;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	if (dev->config.uartx == USART1)			{	priv_data->DMAChannel = DMA1_Channel5;	}
	else if (dev->config.uartx == USART2)	{	priv_data->DMAChannel = DMA1_Channel6;	}
	else if (dev->config.uartx == USART3)	{	priv_data->DMAChannel = DMA1_Channel3;	}
	else if (dev->config.uartx == UART4)		{	priv_data->DMAChannel = DMA2_Channel3;	}
	else	{return -1;}

	/* 配置DMA */
	__uart_config_dma_clock_enable(dev->config.uartx);
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(priv_data->DMAChannel);													// 将DMA的通道寄存器重设为缺省值
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->config.uartx->DR;		// DMA外设基地址
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)(g_rx_str[priv_data->index]);		// DMA内存基地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;									// 数据传输方向，从外设读取发送到内存
	DMA_InitStructure.DMA_BufferSize = sizeof(g_rx_str[priv_data->index]);				// DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址寄存器不变
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址寄存器递增
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 数据宽度为8位
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 数据宽度为8位
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
	DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 中优先级 
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;										// 没有设置为内存到内存传输
	DMA_Init(priv_data->DMAChannel, &DMA_InitStructure);

	/* 中断使能 */
	USART_ITConfig(dev->config.uartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(dev->config.uartx, USART_IT_IDLE, ENABLE);								// 使能UART空闲中断

	/* 开启DMA */
	DMA_Cmd(priv_data->DMAChannel, ENABLE);

	/* 启用UART的DMA请求 */
	USART_DMACmd(dev->config.uartx, USART_DMAReq_Rx, ENABLE);

	#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
	
	/* 配置DMA */
	__uart_config_dma_clock_enable(dev->config.uartx);									// 开启DMA时钟
	DMA_DeInit(__uart_get_dma_stream(dev->config.uartx));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = __uart_get_dma_channel(dev->config.uartx);			// 选择DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->config.uartx->DR;			// DMA外设基地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)(g_rx_str[priv_data->index]);		// DMA内存基地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;								// 从外设读取发送到内存
    DMA_InitStructure.DMA_BufferSize = sizeof(g_rx_str[priv_data->index]);				// DMA通道的DMA缓存的大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 优先级：中
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;								// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;						// FIFO阈值为满
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;							// 内存突发传输为单次
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;					// 外设突发传输为单次
    DMA_Init(__uart_get_dma_stream(dev->config.uartx), &DMA_InitStructure);
					
	/* 中断使能 */
	USART_ITConfig(dev->config.uartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(dev->config.uartx, USART_IT_IDLE, ENABLE);								// 使能UART空闲中断

	/* 开启DMA */
    DMA_Cmd(__uart_get_dma_stream(dev->config.uartx), ENABLE);

	/* 启用UART的DMA请求 */
	USART_DMACmd(dev->config.uartx, USART_DMAReq_Rx, ENABLE);
	
	#endif
	
	/* 函数指针赋值 */
	dev->dma_recv_enable = __uart_dma_recv_enable;
	
	dev->dma_Flag = true;
	
	return 0;
}

/******************************************************************************
 * @brief	UART开启一次DMA接收
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_dma_recv_enable(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = (UARTPrivData_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag || !dev->dma_Flag)
		return -1;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	/* 将接收的内存部分数据清0 */
	memset(g_rx_str[priv_data->index], 0, sizeof(g_rx_str[priv_data->index]));
	
	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(priv_data->DMAChannel, sizeof(g_rx_str[priv_data->index]));

	/* 重新打开DMA */
	DMA_Cmd(priv_data->DMAChannel, ENABLE);
	
	#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
	
	/* 将接收的内存部分数据清0 */
	memset(g_rx_str[priv_data->index], 0, sizeof(g_rx_str[priv_data->index]));

	/* 清除标志位 */
	DMA_ClearFlag(__uart_get_dma_stream(dev->config.uartx), __uart_get_dma_flag(dev->config.uartx));
	USART_ClearFlag(dev->config.uartx, USART_FLAG_IDLE);

	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(__uart_get_dma_stream(dev->config.uartx), sizeof(g_rx_str[priv_data->index]));

	/* 重新打开DMA */
	DMA_Cmd(__uart_get_dma_stream(dev->config.uartx), ENABLE);
	
	#endif

	return 0;
}

/******************************************************************************
 * @brief	UART发送一个字节
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	byte	:  要发送的字节
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/	
static int __uart_send_byte(UARTDev_t *dev, uint8_t byte)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	USART_SendData(dev->config.uartx, byte);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(dev->config.uartx, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	
