903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/uart.c
	return 0;
}

/******************************************************************************
 * @brief	UART发送一个数组
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	array	:  要发送的数组首地址
 * @param	length	:  要发送的数组长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_array(UARTDev_t *dev, uint8_t *array, uint16_t length)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	while (length--)
    {
        __uart_send_byte(dev, *array++);
    }
	
	return 0;
}

/******************************************************************************
 * @brief	UART发送一个字符串
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	str		:  要发送的字符串首地址
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_string(UARTDev_t *dev, char *str)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	while (*str != '\0')
	{
		__uart_send_byte(dev, *str++);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	次方函数
 * @param	x
 * @param	y
 * @return	x^y
 ******************************************************************************/
static uint32_t pow(uint32_t x, uint8_t y)
{
	uint32_t res = 1;
	while (y--)
	{
		res *= x;
	}
	return res;
}

/******************************************************************************
 * @brief	UART发送一个数字
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	num		:  要发送的数字
 * @param	length	:  要发送的数字长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_number(UARTDev_t *dev, uint32_t num, uint8_t length)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	for(i = 0;i < length;i++)
	{
		__uart_send_byte(dev, num / pow(10, length - i - 1) % 10 + '0');
	}
	
	return 0;
}

/******************************************************************************
 * @brief	UART发送HEX数据包
 * @param	dev	:  UARTDev_t 结构体指针
 * @param	packet	:  要发送的HEX数据包首地址
 * @param	length	:  要发送的HEX数据包长度
 * @param	packet	:  要发送的HEX数据包头
 * @param	length	:  要发送的HEX数据包尾
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_send_hex_packet(UARTDev_t *dev, uint8_t *packet, uint8_t length, uint8_t head, uint8_t end)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	__uart_send_byte(dev, head);	//发送包头
	__uart_send_array(dev, packet, length);	//发送数据包
	__uart_send_byte(dev, end);	//发送包尾
	
	return 0;
}

/******************************************************************************
 * @brief	printf重定义（仅UART1可用）
 ******************************************************************************/
int fputc(int ch, FILE *f)
{
	USART_SendData(USART1, ch);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(USART1, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	return ch;
}

/******************************************************************************
 * @brief	printf函数封装（多个串口都可使用）
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_printf(UARTDev_t *dev, char *format, ...)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	char str[100];
	va_list arg;
	va_start(arg, format);
	vsprintf(str, format, arg);
	va_end(arg);
	__uart_send_string(dev, str);
	
	return 0;
}

/******************************************************************************
 * @brief	返回UART接收的文本数据包的首地址
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	UART接收的文本数据包的首地址
 ******************************************************************************/
static char *__uart_recv_string(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = dev->priv_data;
	
	return g_rx_str[priv_data->index];
}

/******************************************************************************
 * @brief	返回UART接收的文本数据包标志位（并自动清除）
 * @param	dev	:  UARTDev_t 结构体指针
 * @return	UART接收的文本数据包标志位
 ******************************************************************************/
static uint8_t __uart_recv_string_flag(UARTDev_t *dev)
{
	UARTPrivData_t *priv_data = dev->priv_data;
	
	if (g_rx_str_flag[priv_data->index] == 1)
	{
		g_rx_str_flag[priv_data->index] = 0;
		
		return 1;
	}
	return 0;
}

/******************************************************************************
 * @brief	去初始化UART
 * @param	dev   :  UARTDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __uart_deinit(UARTDev_t *dev)
{
	if (!dev || !dev->init_flag)
		return -1;
	
	/* 释放私有数据内存 */
	free(dev->priv_data);
    dev->priv_data = NULL;
	
	dev->dma_Flag = false;	// 修改初始化标志
	dev->init_flag = false;
	
	return 0;
}

/******************************************************************************
 * @brief	UART接收文本数据包中断回调函数
 * @param	uartx	：	串口外设
 * @return	无
 ******************************************************************************/
static void __uart_recv_string_callback(UARTPER_t uartx)
{
	uint8_t index;
	if (uartx == USART1)		{index = 0;}
	else if (uartx == USART2)	{index = 1;}
	else if (uartx == USART3)	{index = 2;}
	else if (uartx == UART4)	{index = 3;}
	else if (uartx == UART5)	{index = 4;}
	else if (uartx == USART6)	{index = 5;}
	
	static uint8_t rx_string_num = 0; 						// 接收到文本数据包的数据个数
	
	uint8_t rx_byte = USART_ReceiveData(uartx);
	
	if (rx_string_num < (uint8_t)(sizeof(g_rx_str[index]) - 1)) 	// 确保不越界
	{
		g_rx_str[index][rx_string_num++] = rx_byte;
		if (rx_byte == '\n' && rx_string_num > 1 && g_rx_str[index][rx_string_num - 2] == '\r')	// 检查是否接收到完整的数据包
		{
            g_rx_str[index][rx_string_num - 2] = '\0'; // 结束符
            rx_string_num = 0; 							// 重置接收计数器
            g_rx_str_flag[index] = 1; 					// 标记数据包已接收完成
		}
	}
	else
	{
		rx_string_num = 0;								// 如果接收到的数据超出了数组的大小，重置接收计数器
		g_rx_str_flag[index] = 0;
	}
}

/******************************************************************************
 * @brief	UART1中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART1_IRQHandler(void)
{
	volatile uint8_t clear;
	
	if (USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART1->SR;			// 清除空闲中断
			clear = USART1->DR;			// 清除空闲中断
			g_rx_str_flag[0] = 1;		// 置接收标志位
		
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel5, DISABLE);
			#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
			DMA_Cmd(DMA2_Stream5, DISABLE);
			#endif
	}
	
